The London Housing Data is analyzed in a very Easy To Understand (ETU) language.
Here, we will work on a real project of Data Analysis with Python. 
## Following Questions will be answered in the project with the help of Python. 

1. Convert the Datatype of 'Date' column to Date-Time format.
2. Add a new column ''year'' in the dataframe, which contains years only.(B.2) Add a new column ''month'' as 2nd column in the dataframe, which contains month only.
3. Remove the columns 'year' and 'month' from the dataframe.
4. Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?
5. What is the maximum & minimum 'average_price' per year in england ?
6. What is the Maximum & Minimum No. of Crimes recorded per area ?
7. Show the total count of records of each area, where average price is less than 100000.

-----------------------------------------------------------------------

## The commands that we used in this project :

* import pandas as pd -- To import Pandas library
* pd.read_csv - To import the CSV file in Jupyter notebook
* df.count() - It counts the no. of non-null values of each column.
* df.isnull().sum() - It detects the missing values from the dataframe.
* import seaborn as sns - To import the Seaborn library.
* import matplotlib.pyplot as plt - To import the Matplotlib library.
* sns.heatmap(df.isnull()) - It will show the all columns & missing values in them in heat map form.
* plt.show() - To show the plot.
* df.dtypes - To show the datatype of each column.
* pd.to_datetime(df.Date_Time_Col) - Converts the data-type of Date-Time Column into datetime[ns] datatype.
* df.Time_Col.dt.year - Creating a new column with only year values
* df.Time_Col.dt.month - Creating a new column with only month values.
* df.insert( index , ‘new_column_name’, new_column_values) - To insert a New column at a particular position with values in it.
* df.drop(['Col_name'] , axis=1 , inplace = True) - To drop a column from the dataframe permanently.
* df.groupby(‘Col_name’) - To form groups of all unique values of the column.
* df[df.Col_1 = = ‘Element1’] - Filtering – We are accessing all records with Element1 only of Col_1.
* df.groupby(‘Col_1’)[‘Col_2’] .mean( ) - To create groups - Two Keys – Apply on Col_2 grouped by Col_1.

## Importing libraries

In [1]:
import pandas as pd

## Reading csv data

In [2]:
data = pd.read_csv(r'C:\Users\bilal\pythontutorials\London_Housing_Data.csv')

## exploring data

In [3]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [4]:
data.shape

(13549, 6)

In [5]:
data.index

RangeIndex(start=0, stop=13549, step=1)

In [13]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

In [7]:
data.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

## Convert the Datatype of 'Date' column to Date-Time format.

In [12]:
data.date = pd.to_datetime(data.date)

 ## Add a new column ''year'' in the dataframe, which contains years only.
 ##  Add a new column ''month'' as 2nd column in the dataframe, which contains month only.

In [37]:
data['year'] = data.date.dt.year

In [20]:
data.insert (3, 'Month' , data.date.dt.month)

## Remove the columns 'year' and 'month' from the dataframe.

In [24]:
data.drop(['Month' , 'year'], axis = 1 , inplace = True)

## Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [30]:
#data[data['no_of_crimes'] == 0]
len(data[data['no_of_crimes'] == 0])

104

##  What is the maximum & minimum 'average_price' per year in england ?

In [43]:
englanddata = data[data.area == 'england']

In [44]:
englanddata.groupby('year').average_price.max()

year
1995     53901
1996     55755
1997     61564
1998     65743
1999     75071
2000     84191
2001     95992
2002    119982
2003    138985
2004    160330
2005    167244
2006    182031
2007    194764
2008    191750
2009    174136
2010    180807
2011    177335
2012    180129
2013    188544
2014    203639
2015    219582
2016    231922
2017    242628
2018    248620
2019    250410
2020    247355
Name: average_price, dtype: int64

In [45]:
englanddata.groupby('year').average_price.min()

year
1995     52788
1996     52333
1997     55789
1998     61659
1999     65522
2000     75219
2001     84245
2002     96215
2003    121610
2004    139719
2005    158572
2006    166544
2007    181824
2008    165795
2009    159340
2010    174458
2011    173046
2012    174161
2013    176816
2014    188265
2015    202856
2016    220361
2017    231593
2018    240428
2019    243281
2020    247355
Name: average_price, dtype: int64

##  What is the Maximum & Minimum No. of Crimes recorded per area ?

In [50]:
#data.groupby('area').no_of_crimes.max()
data.groupby('area').no_of_crimes.min()

area
barking and dagenham      1217.0
barnet                    1703.0
bexley                     860.0
brent                     1850.0
bromley                   1441.0
camden                    2079.0
city of london               0.0
croydon                   2031.0
ealing                    1871.0
east midlands                NaN
east of england              NaN
enfield                   1635.0
england                      NaN
greenwich                 1513.0
hackney                   1870.0
hammersmith and fulham    1323.0
haringey                  1536.0
harrow                     937.0
havering                  1130.0
hillingdon                1445.0
hounslow                  1529.0
inner london                 NaN
islington                 1871.0
kensington and chelsea    1347.0
kingston upon thames       692.0
lambeth                   2381.0
lewisham                  1675.0
london                       NaN
merton                     819.0
newham                    2130.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 1487.0
richmond upon thames       700.0
south east                   NaN
south west                   NaN
southwark                 2267.0
sutton                     787.0
tower hamlets             1646.0
waltham forest            1575.0
wandsworth                1582.0
west midlands                NaN
westminster               3504.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

##  Show the total count of records of each area, where average price is less than 100000.

In [54]:
data[data.average_price < 100000].area.value_counts()

True    2209
Name: area, dtype: int64